{
  "articles": [
    {
      "id": "128-civics-questions-2025",
      "file": "blog/128-civics-questions-2025.html",
      "featured": true,
      "title_en": "128 Civics Questions and Answers: 2025 Test Guide",
      "title_es": "128 Preguntas y Respuestas Cívicas: Guía del Examen 2025",
      "excerpt_en": "Prepare for the 2025 citizenship test! Review the 128 civics questions and answers, learn about the latest updates, and practice with Citizenry's mock interviews.",
      "excerpt_es": "¡Prepárate para el examen de ciudadanía 2025! Revisa las 128 preguntas y respuestas cívicas, conoce las últimas actualizaciones y practica con las entrevistas simuladas de Citizenry."
    },
    {
      "id": "english-reading-writing-test-tips",
      "file": "blog/english-reading-writing-test-tips.html",
      "title_en": "English Reading and Writing Test Tips",
      "title_es": "Consejos para el Examen de Lectura y Escritura en Inglés",
      "excerpt_en": "Master the English portion of your citizenship test. Learn the vocabulary words, practice sentences, and tips for the reading and writing components.",
      "excerpt_es": "Domina la parte de inglés de tu examen de ciudadanía. Aprende el vocabulario y consejos para lectura y escritura."
    },
    {
      "id": "do-i-need-a-lawyer-for-citizenship",
      "file": "blog/do-i-need-a-lawyer-for-citizenship.html",
      "title_en": "Do I Need a Lawyer to Apply for US Citizenship?",
      "title_es": "¿Necesito un Abogado para Solicitar la Ciudadanía de EE.UU.?",
      "excerpt_en": "Learn whether you need a lawyer for your N-400 citizenship application. Understand when legal help is beneficial and how to find authorized representatives.",
      "excerpt_es": "Aprende si necesitas un abogado para tu solicitud de ciudadanía N-400. Entiende cuándo la ayuda legal es beneficiosa."
    },
    {
      "id": "changing-name-during-naturalization",
      "file": "blog/changing-name-during-naturalization.html",
      "title_en": "Can I Change My Name During Naturalization?",
      "title_es": "¿Puedo Cambiar Mi Nombre Durante la Naturalización?",
      "excerpt_en": "Learn how to legally change your name during the naturalization process. Understand the difference between judicial and administrative oath ceremonies.",
      "excerpt_es": "Aprende cómo cambiar legalmente tu nombre durante el proceso de naturalización."
    },
    {
      "id": "why-choose-citizenship-test-app-without-ads",
      "file": "blog/why-choose-citizenship-test-app-without-ads.html",
      "title_en": "Why It's Important to Choose a Citizenship Test Study App Without Ads",
      "title_es": "Por Qué es Importante Elegir una App de Estudio para el Examen de Ciudadanía Sin Anuncios",
      "excerpt_en": "Choosing a citizenship test study app without ads can make a real difference in how well you learn. Ads get in the way of focus and consistency. Here is why an ad-free app is worth considering and how",
      "excerpt_es": "Elegir una app de estudio para el examen de ciudadanía sin anuncios puede marcar una diferencia real en qué tan bien aprendes. Los anuncios se interponen en la concentración y la constancia. Aquí verá"
    },
    {
      "id": "green-card-expiring-while-n400-pending",
      "file": "blog/green-card-expiring-while-n400-pending.html",
      "title_en": "What If My Green Card Expires While N-400 is Pending?",
      "title_es": "¿Qué Pasa Si Mi Green Card Expira Mientras Mi N-400 Está Pendiente?",
      "excerpt_en": "Learn what to do if your Green Card expires while your citizenship application is pending. Understand the automatic 24-month extension and Form I-90.",
      "excerpt_es": "Aprende qué hacer si tu Green Card expira mientras tu solicitud de ciudadanía está pendiente."
    },
    {
      "id": "best-way-to-study-for-citizenship-test",
      "file": "blog/best-way-to-study-for-citizenship-test.html",
      "title_en": "What is the Best Way to Study for the Citizenship Test?",
      "title_es": "¿Cuál es la Mejor Forma de Estudiar para el Examen de Ciudadanía?",
      "excerpt_en": "The best way to study for the citizenship test is to use official USCIS materials in conjunction with a study app that fits your learning style, and practice answering out loud. The test is an oral in",
      "excerpt_es": "La mejor forma de estudiar para el examen de ciudadanía es usar los materiales oficiales de USCIS junto con una app de estudio que se adapte a tu estilo de aprendizaje y practicar respondiendo en voz "
    },
    {
      "id": "what-if-i-fail-citizenship-test",
      "file": "blog/what-if-i-fail-citizenship-test.html",
      "title_en": "What Happens If I Fail the Citizenship Test?",
      "title_es": "¿Qué Pasa Si No Apruebo el Examen de Ciudadanía?",
      "excerpt_en": "Learn what happens if you fail the US citizenship test. Understand the retesting process, timeline, and how to prepare for your second attempt.",
      "excerpt_es": "Aprende qué pasa si no apruebas el examen de ciudadanía. Entiende el proceso de reexamen y cómo prepararte."
    },
    {
      "id": "best-apps-citizenship-test-preparation",
      "file": "blog/best-apps-citizenship-test-preparation.html",
      "title_en": "Best Apps for Citizenship Test Preparation",
      "title_es": "Mejores Apps para Preparar el Examen de Ciudadanía",
      "excerpt_en": "Many apps can help you prepare for the US citizenship test. The best one for you depends on which test version you take, how you like to study, and whether you want features like mock interviews or mu",
      "excerpt_es": "Muchas apps pueden ayudarte a prepararte para el examen de ciudadanía de EE.UU. La mejor para ti depende de qué versión del examen tomes, cómo te gusta estudiar y si quieres funciones como entrevistas"
    },
    {
      "id": "continuous-residence-vs-physical-presence",
      "file": "blog/continuous-residence-vs-physical-presence.html",
      "title_en": "Continuous Residence vs Physical Presence: What's the Difference?",
      "title_es": "Residencia Continua vs Presencia Física: ¿Cuál es la Diferencia?",
      "excerpt_en": "Understand the difference between continuous residence and physical presence requirements for US citizenship. Learn how travel affects your naturalization eligibility.",
      "excerpt_es": "Entiende la diferencia entre los requisitos de residencia continua y presencia física para la ciudadanía."
    },
    {
      "id": "is-citizenship-test-changing-2026",
      "file": "blog/is-citizenship-test-changing-2026.html",
      "title_en": "Is the Citizenship Test Changing in 2026?",
      "title_es": "¿Está Cambiando el Examen de Ciudadanía en 2026?",
      "excerpt_en": "The citizenship test already changed in late 2025. In 2026 there is no additional change scheduled. What matters is which version you take based on when you filed your application.",
      "excerpt_es": "El examen de ciudadanía ya cambió a fines de 2025. En 2026 no hay ningún cambio adicional programado. Lo que importa es qué versión te toca según cuándo presentaste tu solicitud."
    },
    {
      "id": "selective-service-registration",
      "file": "blog/selective-service-registration.html",
      "title_en": "Selective Service Registration: What Male Applicants Need to Know",
      "title_es": "Registro del Servicio Selectivo: Lo que los Solicitantes Masculinos Deben Saber",
      "excerpt_en": "Learn about Selective Service registration requirements for male citizenship applicants. Understand what happens if you didn't register and how it affects naturalization.",
      "excerpt_es": "Aprende sobre los requisitos de registro del Servicio Selectivo para solicitantes masculinos de ciudadanía."
    },
    {
      "id": "spouses-of-us-citizens-3-year-rule",
      "file": "blog/spouses-of-us-citizens-3-year-rule.html",
      "title_en": "Naturalization for Spouses of US Citizens: The 3-Year Rule Explained",
      "title_es": "Naturalización para Cónyuges de Ciudadanos de EE.UU.: La Regla de 3 Años Explicada",
      "excerpt_en": "Learn about the 3-year naturalization rule for spouses of US citizens. Understand eligibility requirements, marital union, and how to apply for citizenship sooner.",
      "excerpt_es": "Aprende sobre la regla de naturalización de 3 años para cónyuges de ciudadanos de EE.UU."
    },
    {
      "id": "how-many-questions-for-citizenship-2026",
      "file": "blog/how-many-questions-for-citizenship-2026.html",
      "title_en": "How Many Questions for Citizenship 2026?",
      "title_es": "¿Cuántas Preguntas Son para la Ciudadanía 2026?",
      "excerpt_en": "If you are preparing for U.S. citizenship in 2026, the number of civics questions depends on your N-400 filing date. USCIS now uses two civics test versions, and most 2026 applicants take the newer 20",
      "excerpt_es": "Si te estás preparando para la ciudadanía de EE.UU. en 2026, el número de preguntas cívicas depende de la fecha en que presentaste tu N-400."
    },
    {
      "id": "conditional-green-card-citizenship",
      "file": "blog/conditional-green-card-citizenship.html",
      "title_en": "Conditional Green Card Holders: Applying for Citizenship",
      "title_es": "Titulares de Green Card Condicional: Solicitando la Ciudadanía",
      "excerpt_en": "Learn how conditional green card holders can apply for US citizenship. Understand the I-751 process, timing for N-400, and what to do if conditions aren't removed yet.",
      "excerpt_es": "Aprende cómo los titulares de green card condicional pueden solicitar la ciudadanía de EE.UU."
    },
    {
      "id": "common-reasons-citizenship-denied",
      "file": "blog/common-reasons-citizenship-denied.html",
      "title_en": "Common Reasons Citizenship Applications Get Denied",
      "title_es": "Razones Comunes por las que se Niegan Solicitudes de Ciudadanía",
      "excerpt_en": "Learn the most common reasons N-400 citizenship applications are denied and how to avoid them. Understand eligibility issues and test failures.",
      "excerpt_es": "Aprende las razones más comunes por las que se niegan solicitudes N-400 y cómo evitarlas."
    },
    {
      "id": "english-reading-writing-test-tips",
      "file": "blog/english-reading-writing-test-tips.html",
      "title_en": "English Reading and Writing Test Tips",
      "title_es": "Consejos para el Examen de Lectura y Escritura en Inglés",
      "excerpt_en": "Master the English portion of your citizenship test. Learn the vocabulary words, practice sentences, and tips for the reading and writing components.",
      "excerpt_es": "Domina la parte de inglés de tu examen de ciudadanía. Aprende el vocabulario y consejos para lectura y escritura."
    },
    {
      "id": "oath-ceremony-what-to-expect",
      "file": "blog/oath-ceremony-what-to-expect.html",
      "title_en": "What to Expect at Your Oath Ceremony",
      "title_es": "Qué Esperar en Tu Ceremonia de Juramento",
      "excerpt_en": "Everything you need to know about the naturalization oath ceremony. Learn what happens, what to bring, and what to do after you become a US citizen.",
      "excerpt_es": "Todo lo que necesitas saber sobre la ceremonia de juramento de naturalización."
    },
    {
      "id": "how-many-questions-citizenship-civics-test",
      "file": "blog/how-many-questions-citizenship-civics-test.html",
      "title_en": "How Many Questions Are on the U.S. Citizenship Civics Test, and How Many Do I Need to Pass?",
      "title_es": "¿Cuántas Preguntas Tiene el Examen Cívico de Ciudadanía de EE.UU. y Cuántas Necesito Aprobar?",
      "excerpt_en": "Direct answer: 2008 test has 100 questions (pass with 6 of 10 correct). 2025 test has 128 questions (pass with 12 of 20 correct). Find out which test you take.",
      "excerpt_es": "Respuesta directa: examen 2008 tiene 100 preguntas (6 de 10 correctas); examen 2025 tiene 128 (12 de 20 correctas)."
    },
    {
      "id": "naturalization-eligibility-requirements",
      "file": "blog/naturalization-eligibility-requirements.html",
      "title_en": "Naturalization Requirements: Are You Eligible?",
      "title_es": "Requisitos de Naturalización: ¿Es Elegible?",
      "excerpt_en": "Check if you meet the eligibility requirements for US citizenship. Learn about residence, physical presence, age, and other naturalization requirements.",
      "excerpt_es": "Verifica si cumples con los requisitos de elegibilidad para la ciudadanía."
    },
    {
      "id": "check-n400-case-status",
      "file": "blog/check-n400-case-status.html",
      "title_en": "How to Check Your N-400 Case Status",
      "title_es": "Cómo Verificar el Estado de Tu Caso N-400",
      "excerpt_en": "Learn what each status update means and how to track your N-400 application step by step using the USCIS online portal.",
      "excerpt_es": "Aprende qué significa cada actualización de estado y cómo rastrear tu solicitud N-400."
    },
    {
      "id": "citizenship-through-military-service",
      "file": "blog/citizenship-through-military-service.html",
      "title_en": "Citizenship Through Military Service",
      "title_es": "Ciudadanía a Través del Servicio Militar",
      "excerpt_en": "Learn how military service can expedite your path to US citizenship. Understand requirements for active duty, veterans, and family members of service members.",
      "excerpt_es": "Aprende cómo el servicio militar puede acelerar tu camino hacia la ciudadanía."
    },
    {
      "id": "how-to-apply-for-us-citizenship",
      "file": "blog/how-to-apply-for-us-citizenship.html",
      "title_en": "How to Apply for US Citizenship (Step-by-Step Guide)",
      "title_es": "Cómo Solicitar la Ciudadanía de EE.UU. (Guía Paso a Paso)",
      "excerpt_en": "Complete guide on how to apply for US citizenship through naturalization. Learn the steps, requirements, forms, and timeline for becoming an American citizen.",
      "excerpt_es": "Guía completa sobre cómo solicitar la ciudadanía estadounidense a través de la naturalización. Aprende los pasos, requisitos, formularios y cronograma."
    },
    {
      "id": "n400-filing-fees-and-fee-waivers",
      "file": "blog/n400-filing-fees-and-fee-waivers.html",
      "title_en": "N-400 Filing Fees and Fee Waivers Explained",
      "title_es": "Tarifas del N-400 y Exenciones de Tarifas Explicadas",
      "excerpt_en": "Learn about N-400 citizenship application fees, fee waivers, and reduced fee options. Find out if you qualify for free or reduced-cost naturalization.",
      "excerpt_es": "Aprende sobre las tarifas de solicitud de ciudadanía N-400, exenciones de tarifas y opciones de tarifa reducida."
    },
    {
      "id": "hardest-citizenship-test-questions",
      "file": "blog/hardest-citizenship-test-questions.html",
      "title_en": "What Are the Hardest US Citizenship Test Questions?",
      "title_es": "¿Cuáles Son las Preguntas Más Difíciles del Examen de Ciudadanía de EE.UU.?",
      "excerpt_en": "Discover which US citizenship test questions are the hardest and learn strategies to master the toughest civics topics.",
      "excerpt_es": "Descubre cuáles son las preguntas más difíciles del examen de ciudadanía y aprende estrategias para dominar los temas cívicos más difíciles."
    },
    {
      "id": "best-study-guides-citizenship-test",
      "file": "blog/best-study-guides-citizenship-test.html",
      "title_en": "Best Study Guides for the US Citizenship Test",
      "title_es": "Las Mejores Guías de Estudio para el Examen de Ciudadanía de EE.UU.",
      "excerpt_en": "A complete guide to the best study resources for the US citizenship test, including official USCIS materials, flashcards, and practice tests.",
      "excerpt_es": "Una guía completa de los mejores recursos de estudio para el examen de ciudadanía, incluyendo materiales oficiales de USCIS y exámenes de práctica."
    },
    {
      "id": "most-missed-citizenship-test-questions",
      "file": "blog/most-missed-citizenship-test-questions.html",
      "title_en": "Which Citizenship Test Questions Do People Miss Most?",
      "title_es": "¿Cuáles Preguntas del Examen de Ciudadanía Fallan Más las Personas?",
      "excerpt_en": "Learn which US citizenship test questions trip up the most applicants and how to avoid common mistakes on the civics test.",
      "excerpt_es": "Aprende qué preguntas del examen de ciudadanía fallan más y cómo evitar errores comunes en el examen cívico."
    },
    {
      "id": "how-long-does-naturalization-take",
      "file": "blog/how-long-does-naturalization-take.html",
      "title_en": "How Long Does the Naturalization Process Take?",
      "title_es": "¿Cuánto Tiempo Toma el Proceso de Naturalización?",
      "excerpt_en": "Learn how long the US citizenship process takes from N-400 application to oath ceremony. Understand processing times, timelines, and what affects wait times.",
      "excerpt_es": "Aprende cuánto tiempo toma el proceso de ciudadanía desde la solicitud N-400 hasta la ceremonia de juramento."
    },
    {
      "id": "n400-interview-preparation",
      "file": "blog/n400-interview-preparation.html",
      "title_en": "How to Prepare for the N-400 Interview",
      "title_es": "Cómo Prepararse para la Entrevista N-400",
      "excerpt_en": "Learn what to expect during your N-400 interview and how to answer questions confidently. Practice with mock interviews to build your confidence.",
      "excerpt_es": "Aprende qué esperar durante tu entrevista N-400 y cómo responder preguntas con confianza."
    },
    {
      "id": "what-happens-after-citizenship-test",
      "file": "blog/what-happens-after-citizenship-test.html",
      "title_en": "What Happens After You Pass the Citizenship Test?",
      "title_es": "¿Qué Sucede Después de Aprobar el Examen de Ciudadanía?",
      "excerpt_en": "Learn what to expect after passing your US citizenship test. From approval to oath ceremony, understand the final steps to becoming an American citizen.",
      "excerpt_es": "Aprende qué esperar después de aprobar tu examen de ciudadanía. Desde la aprobación hasta la ceremonia de juramento."
    },
    {
      "id": "2008-vs-2025-civics-test",
      "file": "blog/2008-vs-2025-civics-test.html",
      "title_en": "2008 vs 2025 Civics Test: What's Different?",
      "title_es": "Examen Cívico 2008 vs 2025: ¿Qué es Diferente?",
      "excerpt_en": "Understand the key differences between the 100-question 2008 test and the new 128-question 2025 test. Find out which version you'll take based on your N-400 filing date.",
      "excerpt_es": "Comprende las diferencias clave entre el examen de 100 preguntas de 2008 y el nuevo examen de 128 preguntas de 2025."
    },
    {
      "id": "how-to-pass-citizenship-test",
      "file": "blog/how-to-pass-citizenship-test.html",
      "title_en": "How to Pass the US Citizenship Test",
      "title_es": "Cómo Aprobar el Examen de Ciudadanía de EE.UU.",
      "excerpt_en": "Step-by-step tips on how to pass the citizenship test, including study routines, practice questions, and techniques so you feel ready on test day.",
      "excerpt_es": "Consejos paso a paso sobre cómo aprobar el examen de ciudadanía, incluyendo rutinas de estudio y técnicas."
    },
    {
      "id": "citizenship-test-exemptions",
      "file": "blog/citizenship-test-exemptions.html",
      "title_en": "Citizenship Test Exemptions: Age and Disability Accommodations",
      "title_es": "Exenciones del Examen: Adaptaciones por Edad y Discapacidad",
      "excerpt_en": "Learn about exemptions from the citizenship test for elderly applicants and those with disabilities. Understand the 65/20 exception and medical disability waivers.",
      "excerpt_es": "Aprende sobre exenciones del examen de ciudadanía para solicitantes de edad avanzada y personas con discapacidades."
    },
    {
      "id": "can-i-travel-while-n400-pending",
      "file": "blog/can-i-travel-while-n400-pending.html",
      "title_en": "Can I Travel While My N-400 is Pending?",
      "title_es": "¿Puedo Viajar Mientras Mi N-400 Está Pendiente?",
      "excerpt_en": "Learn about traveling outside the US while your citizenship application is pending. Understand the risks, requirements, and what to bring when you return.",
      "excerpt_es": "Aprende sobre viajar fuera de EE.UU. mientras tu solicitud de ciudadanía está pendiente."
    },
    {
      "id": "what-to-bring-citizenship-interview",
      "file": "blog/what-to-bring-citizenship-interview.html",
      "title_en": "What to Bring to Your Citizenship Interview",
      "title_es": "Qué Llevar a Tu Entrevista de Ciudadanía",
      "excerpt_en": "A complete checklist of documents and items you need to bring to your USCIS citizenship interview. Be prepared and avoid delays.",
      "excerpt_es": "Una lista completa de documentos y artículos que necesitas llevar a tu entrevista de ciudadanía."
    },
    {
      "id": "common-reasons-citizenship-denied",
      "file": "blog/common-reasons-citizenship-denied.html",
      "title_en": "Common Reasons Citizenship Applications Get Denied",
      "title_es": "Razones Comunes por las que se Niegan Solicitudes de Ciudadanía",
      "excerpt_en": "Learn the most common reasons N-400 citizenship applications are denied and how to avoid them. Understand eligibility issues and test failures.",
      "excerpt_es": "Aprende las razones más comunes por las que se niegan solicitudes N-400 y cómo evitarlas."
    }
  ]
}